package com.example.areaselectorlibrary;

import java.util.List;

class PcasModel {

    private List<ProvinceListBean> provinceList;

    public List<ProvinceListBean> getProvinceList() {
        return provinceList;
    }

    public void setProvinceList(List<ProvinceListBean> provinceList) {
        this.provinceList = provinceList;
    }

    public static class ProvinceListBean {
        /**
         * code : 11
         * name : 北京市
         * children : [{"code":"1101","name":"市辖区","children":[{"code":"110101","name":"东城区","children":[{"code":"110101001","name":"东华门街道"},{"code":"110101002","name":"景山街道"},{"code":"110101003","name":"交道口街道"},{"code":"110101004","name":"安定门街道"},{"code":"110101005","name":"北新桥街道"},{"code":"110101006","name":"东四街道"},{"code":"110101007","name":"朝阳门街道"},{"code":"110101008","name":"建国门街道"},{"code":"110101009","name":"东直门街道"},{"code":"110101010","name":"和平里街道"},{"code":"110101011","name":"前门街道"},{"code":"110101012","name":"崇文门外街道"},{"code":"110101013","name":"东花市街道"},{"code":"110101014","name":"龙潭街道"},{"code":"110101015","name":"体育馆路街道"},{"code":"110101016","name":"天坛街道"},{"code":"110101017","name":"永定门外街道"}]},{"code":"110102","name":"西城区","children":[{"code":"110102001","name":"西长安街街道"},{"code":"110102003","name":"新街口街道"},{"code":"110102007","name":"月坛街道"},{"code":"110102009","name":"展览路街道"},{"code":"110102010","name":"德胜街道"},{"code":"110102011","name":"金融街街道"},{"code":"110102012","name":"什刹海街道"},{"code":"110102013","name":"大栅栏街道"},{"code":"110102014","name":"天桥街道"},{"code":"110102015","name":"椿树街道"},{"code":"110102016","name":"陶然亭街道"},{"code":"110102017","name":"广安门内街道"},{"code":"110102018","name":"牛街街道"},{"code":"110102019","name":"白纸坊街道"},{"code":"110102020","name":"广安门外街道"}]},{"code":"110105","name":"朝阳区","children":[{"code":"110105001","name":"建外街道"},{"code":"110105002","name":"朝外街道"},{"code":"110105003","name":"呼家楼街道"},{"code":"110105004","name":"三里屯街道"},{"code":"110105005","name":"左家庄街道"},{"code":"110105006","name":"香河园街道"},{"code":"110105007","name":"和平街街道"},{"code":"110105008","name":"安贞街道"},{"code":"110105009","name":"亚运村街道"},{"code":"110105010","name":"小关街道"},{"code":"110105011","name":"酒仙桥街道"},{"code":"110105012","name":"麦子店街道"},{"code":"110105013","name":"团结湖街道"},{"code":"110105014","name":"六里屯街道"},{"code":"110105015","name":"八里庄街道"},{"code":"110105016","name":"双井街道"},{"code":"110105017","name":"劲松街道"},{"code":"110105018","name":"潘家园街道"},{"code":"110105019","name":"垡头街道"},{"code":"110105021","name":"南磨房地区"},{"code":"110105022","name":"高碑店地区"},{"code":"110105023","name":"将台地区"},{"code":"110105024","name":"太阳宫地区"},{"code":"110105025","name":"大屯街道"},{"code":"110105026","name":"望京街道"},{"code":"110105027","name":"小红门地区"},{"code":"110105028","name":"十八里店地区"},{"code":"110105029","name":"平房地区"},{"code":"110105030","name":"东风地区"},{"code":"110105031","name":"奥运村街道"},{"code":"110105032","name":"来广营地区"},{"code":"110105033","name":"常营地区"},{"code":"110105034","name":"三间房地区"},{"code":"110105035","name":"管庄地区"},{"code":"110105036","name":"金盏地区"},{"code":"110105037","name":"孙河地区"},{"code":"110105038","name":"崔各庄地区"},{"code":"110105039","name":"东坝地区"},{"code":"110105040","name":"黑庄户地区"},{"code":"110105041","name":"豆各庄地区"},{"code":"110105042","name":"王四营地区"},{"code":"110105043","name":"东湖街道"},{"code":"110105400","name":"首都机场街道"}]},{"code":"110106","name":"丰台区","children":[{"code":"110106001","name":"右安门街道"},{"code":"110106002","name":"太平桥街道"},{"code":"110106003","name":"西罗园街道"},{"code":"110106004","name":"大红门街道"},{"code":"110106005","name":"南苑街道"},{"code":"110106006","name":"东高地街道"},{"code":"110106007","name":"东铁匠营街道"},{"code":"110106008","name":"卢沟桥街道"},{"code":"110106009","name":"丰台街道"},{"code":"110106010","name":"新村街道"},{"code":"110106011","name":"长辛店街道"},{"code":"110106012","name":"云岗街道"},{"code":"110106013","name":"方庄地区"},{"code":"110106014","name":"宛平城地区"},{"code":"110106015","name":"马家堡街道"},{"code":"110106016","name":"和义街道"},{"code":"110106017","name":"卢沟桥地区"},{"code":"110106018","name":"花乡地区"},{"code":"110106019","name":"南苑地区"},{"code":"110106100","name":"长辛店镇"},{"code":"110106101","name":"王佐镇"}]},{"code":"110107","name":"石景山区","children":[{"code":"110107001","name":"八宝山街道"},{"code":"110107002","name":"老山街道"},{"code":"110107003","name":"八角街道"},{"code":"110107004","name":"古城街道"},{"code":"110107005","name":"苹果园街道"},{"code":"110107006","name":"金顶街街道"},{"code":"110107009","name":"广宁街道"},{"code":"110107010","name":"五里坨街道"},{"code":"110107011","name":"鲁谷街道"}]},{"code":"110108","name":"海淀区","children":[{"code":"110108001","name":"万寿路街道"},{"code":"110108002","name":"永定路街道"},{"code":"110108003","name":"羊坊店街道"},{"code":"110108004","name":"甘家口街道"},{"code":"110108005","name":"八里庄街道"},{"code":"110108006","name":"紫竹院街道"},{"code":"110108007","name":"北下关街道"},{"code":"110108008","name":"北太平庄街道"},{"code":"110108010","name":"学院路街道"},{"code":"110108011","name":"中关村街道"},{"code":"110108012","name":"海淀街道"},{"code":"110108013","name":"青龙桥街道"},{"code":"110108014","name":"清华园街道"},{"code":"110108015","name":"燕园街道"},{"code":"110108016","name":"香山街道"},{"code":"110108017","name":"清河街道"},{"code":"110108018","name":"花园路街道"},{"code":"110108019","name":"西三旗街道"},{"code":"110108020","name":"马连洼街道"},{"code":"110108021","name":"田村路街道"},{"code":"110108022","name":"上地街道"},{"code":"110108023","name":"万柳地区"},{"code":"110108024","name":"东升地区"},{"code":"110108025","name":"曙光街道"},{"code":"110108026","name":"温泉地区"},{"code":"110108027","name":"四季青地区"},{"code":"110108028","name":"西北旺地区"},{"code":"110108029","name":"苏家坨地区"},{"code":"110108030","name":"上庄地区"}]},{"code":"110109","name":"门头沟区","children":[{"code":"110109001","name":"大峪街道"},{"code":"110109002","name":"城子街道"},{"code":"110109003","name":"东辛房街道"},{"code":"110109004","name":"大台街道"},{"code":"110109005","name":"王平地区"},{"code":"110109006","name":"永定地区"},{"code":"110109007","name":"龙泉地区"},{"code":"110109101","name":"潭柘寺镇"},{"code":"110109104","name":"军庄镇"},{"code":"110109105","name":"雁翅镇"},{"code":"110109106","name":"斋堂镇"},{"code":"110109107","name":"清水镇"},{"code":"110109108","name":"妙峰山镇"}]},{"code":"110111","name":"房山区","children":[{"code":"110111001","name":"城关街道"},{"code":"110111002","name":"新镇街道"},{"code":"110111004","name":"向阳街道"},{"code":"110111005","name":"东风街道"},{"code":"110111006","name":"迎风街道"},{"code":"110111007","name":"星城街道"},{"code":"110111008","name":"良乡地区"},{"code":"110111009","name":"周口店地区"},{"code":"110111010","name":"琉璃河地区"},{"code":"110111011","name":"拱辰街道"},{"code":"110111012","name":"西潞街道"},{"code":"110111101","name":"阎村镇"},{"code":"110111103","name":"窦店镇"},{"code":"110111104","name":"石楼镇"},{"code":"110111105","name":"长阳镇"},{"code":"110111107","name":"河北镇"},{"code":"110111108","name":"长沟镇"},{"code":"110111109","name":"大石窝镇"},{"code":"110111110","name":"张坊镇"},{"code":"110111111","name":"十渡镇"},{"code":"110111112","name":"青龙湖镇"},{"code":"110111115","name":"韩村河镇"},{"code":"110111208","name":"霞云岭乡"},{"code":"110111209","name":"南窖乡"},{"code":"110111210","name":"佛子庄乡"},{"code":"110111211","name":"大安山乡"},{"code":"110111212","name":"史家营乡"},{"code":"110111213","name":"蒲洼乡"}]},{"code":"110112","name":"通州区","children":[{"code":"110112001","name":"中仓街道"},{"code":"110112002","name":"新华街道"},{"code":"110112003","name":"北苑街道"},{"code":"110112004","name":"玉桥街道"},{"code":"110112005","name":"永顺地区"},{"code":"110112006","name":"梨园地区"},{"code":"110112007","name":"潞源街道"},{"code":"110112008","name":"通运街道"},{"code":"110112104","name":"宋庄镇"},{"code":"110112105","name":"张家湾镇"},{"code":"110112106","name":"漷县镇"},{"code":"110112109","name":"马驹桥镇"},{"code":"110112110","name":"西集镇"},{"code":"110112114","name":"台湖镇"},{"code":"110112117","name":"永乐店镇"},{"code":"110112119","name":"潞城镇"},{"code":"110112209","name":"于家务回族乡"}]},{"code":"110113","name":"顺义区","children":[{"code":"110113001","name":"胜利街道"},{"code":"110113002","name":"光明街道"},{"code":"110113003","name":"仁和地区"},{"code":"110113004","name":"后沙峪地区"},{"code":"110113005","name":"天竺地区"},{"code":"110113006","name":"杨镇地区"},{"code":"110113007","name":"牛栏山地区"},{"code":"110113008","name":"南法信地区"},{"code":"110113009","name":"马坡地区"},{"code":"110113010","name":"石园街道"},{"code":"110113011","name":"空港街道"},{"code":"110113012","name":"双丰街道"},{"code":"110113013","name":"旺泉街道"},{"code":"110113101","name":"高丽营镇"},{"code":"110113104","name":"李桥镇"},{"code":"110113105","name":"李遂镇"},{"code":"110113106","name":"南彩镇"},{"code":"110113108","name":"北务镇"},{"code":"110113109","name":"大孙各庄镇"},{"code":"110113110","name":"张镇"},{"code":"110113111","name":"龙湾屯镇"},{"code":"110113112","name":"木林镇"},{"code":"110113113","name":"北小营镇"},{"code":"110113115","name":"北石槽镇"},{"code":"110113116","name":"赵全营镇"}]},{"code":"110114","name":"昌平区","children":[{"code":"110114001","name":"城北街道"},{"code":"110114002","name":"南口地区"},{"code":"110114003","name":"马池口地区"},{"code":"110114004","name":"沙河地区"},{"code":"110114005","name":"城南街道"},{"code":"110114007","name":"东小口地区"},{"code":"110114008","name":"天通苑北街道"},{"code":"110114009","name":"天通苑南街道"},{"code":"110114010","name":"霍营街道"},{"code":"110114011","name":"回龙观街道"},{"code":"110114012","name":"龙泽园街道"},{"code":"110114013","name":"史各庄街道"},{"code":"110114104","name":"阳坊镇"},{"code":"110114110","name":"小汤山镇"},{"code":"110114111","name":"南邵镇"},{"code":"110114112","name":"崔村镇"},{"code":"110114113","name":"百善镇"},{"code":"110114115","name":"北七家镇"},{"code":"110114116","name":"兴寿镇"},{"code":"110114118","name":"流村镇"},{"code":"110114119","name":"十三陵镇"},{"code":"110114120","name":"延寿镇"}]},{"code":"110115","name":"大兴区","children":[{"code":"110115001","name":"兴丰街道"},{"code":"110115002","name":"林校路街道"},{"code":"110115003","name":"清源街道"},{"code":"110115004","name":"亦庄地区"},{"code":"110115005","name":"黄村地区"},{"code":"110115006","name":"旧宫地区"},{"code":"110115007","name":"西红门地区"},{"code":"110115008","name":"瀛海地区"},{"code":"110115009","name":"观音寺街道"},{"code":"110115010","name":"天宫院街道"},{"code":"110115011","name":"高米店街道"},{"code":"110115012","name":"荣华街道"},{"code":"110115013","name":"博兴街道"},{"code":"110115103","name":"青云店镇"},{"code":"110115104","name":"采育镇"},{"code":"110115105","name":"安定镇"},{"code":"110115106","name":"礼贤镇"},{"code":"110115107","name":"榆垡镇"},{"code":"110115108","name":"庞各庄镇"},{"code":"110115109","name":"北臧村镇"},{"code":"110115110","name":"魏善庄镇"},{"code":"110115111","name":"长子营镇"},{"code":"110115403","name":"北京经济技术开发区"},{"code":"110115404","name":"中关村国家自主创新示范区大兴生物医药产业基地"},{"code":"110115405","name":"国家新媒体产业基地"},{"code":"110115406","name":"大兴国际机场"}]},{"code":"110116","name":"怀柔区","children":[{"code":"110116001","name":"泉河街道"},{"code":"110116002","name":"龙山街道"},{"code":"110116003","name":"怀柔地区"},{"code":"110116004","name":"雁栖地区"},{"code":"110116005","name":"庙城地区"},{"code":"110116102","name":"北房镇"},{"code":"110116103","name":"杨宋镇"},{"code":"110116105","name":"桥梓镇"},{"code":"110116106","name":"怀北镇"},{"code":"110116107","name":"汤河口镇"},{"code":"110116108","name":"渤海镇"},{"code":"110116109","name":"九渡河镇"},{"code":"110116110","name":"琉璃庙镇"},{"code":"110116111","name":"宝山镇"},{"code":"110116211","name":"长哨营满族乡"},{"code":"110116213","name":"喇叭沟门满族乡"},{"code":"110116400","name":"北京雁栖经济开发区"}]},{"code":"110117","name":"平谷区","children":[{"code":"110117001","name":"滨河街道"},{"code":"110117002","name":"兴谷街道"},{"code":"110117003","name":"渔阳地区"},{"code":"110117004","name":"峪口地区"},{"code":"110117005","name":"马坊地区"},{"code":"110117006","name":"金海湖地区"},{"code":"110117101","name":"东高村镇"},{"code":"110117102","name":"山东庄镇"},{"code":"110117104","name":"南独乐河镇"},{"code":"110117105","name":"大华山镇"},{"code":"110117106","name":"夏各庄镇"},{"code":"110117108","name":"马昌营镇"},{"code":"110117110","name":"王辛庄镇"},{"code":"110117111","name":"大兴庄镇"},{"code":"110117112","name":"刘家店镇"},{"code":"110117114","name":"镇罗营镇"},{"code":"110117213","name":"黄松峪乡"},{"code":"110117214","name":"熊儿寨乡"}]},{"code":"110118","name":"密云区","children":[{"code":"110118001","name":"鼓楼街道"},{"code":"110118002","name":"果园街道"},{"code":"110118003","name":"檀营地区"},{"code":"110118100","name":"密云镇"},{"code":"110118101","name":"溪翁庄镇"},{"code":"110118102","name":"西田各庄镇"},{"code":"110118103","name":"十里堡镇"},{"code":"110118104","name":"河南寨镇"},{"code":"110118105","name":"巨各庄镇"},{"code":"110118106","name":"穆家峪镇"},{"code":"110118107","name":"太师屯镇"},{"code":"110118108","name":"高岭镇"},{"code":"110118109","name":"不老屯镇"},{"code":"110118110","name":"冯家峪镇"},{"code":"110118111","name":"古北口镇"},{"code":"110118112","name":"大城子镇"},{"code":"110118113","name":"东邵渠镇"},{"code":"110118114","name":"北庄镇"},{"code":"110118115","name":"新城子镇"},{"code":"110118116","name":"石城镇"},{"code":"110118400","name":"北京密云经济开发区"}]},{"code":"110119","name":"延庆区","children":[{"code":"110119001","name":"百泉街道"},{"code":"110119002","name":"香水园街道"},{"code":"110119003","name":"儒林街道"},{"code":"110119100","name":"延庆镇"},{"code":"110119101","name":"康庄镇"},{"code":"110119102","name":"八达岭镇"},{"code":"110119103","name":"永宁镇"},{"code":"110119104","name":"旧县镇"},{"code":"110119105","name":"张山营镇"},{"code":"110119106","name":"四海镇"},{"code":"110119107","name":"千家店镇"},{"code":"110119108","name":"沈家营镇"},{"code":"110119109","name":"大榆树镇"},{"code":"110119110","name":"井庄镇"},{"code":"110119200","name":"大庄科乡"},{"code":"110119201","name":"刘斌堡乡"},{"code":"110119202","name":"香营乡"},{"code":"110119203","name":"珍珠泉乡"}]}]}]
         */

        private String code;
        private String name;
        private List<CityBean> children;

        public String getCode() {
            return code;
        }

        public void setCode(String code) {
            this.code = code;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public List<CityBean> getChildren() {
            return children;
        }

        public void setChildren(List<CityBean> children) {
            this.children = children;
        }

        public static class CityBean {
            /**
             * code : 1101
             * name : 市辖区
             * children : [{"code":"110101","name":"东城区","children":[{"code":"110101001","name":"东华门街道"},{"code":"110101002","name":"景山街道"},{"code":"110101003","name":"交道口街道"},{"code":"110101004","name":"安定门街道"},{"code":"110101005","name":"北新桥街道"},{"code":"110101006","name":"东四街道"},{"code":"110101007","name":"朝阳门街道"},{"code":"110101008","name":"建国门街道"},{"code":"110101009","name":"东直门街道"},{"code":"110101010","name":"和平里街道"},{"code":"110101011","name":"前门街道"},{"code":"110101012","name":"崇文门外街道"},{"code":"110101013","name":"东花市街道"},{"code":"110101014","name":"龙潭街道"},{"code":"110101015","name":"体育馆路街道"},{"code":"110101016","name":"天坛街道"},{"code":"110101017","name":"永定门外街道"}]},{"code":"110102","name":"西城区","children":[{"code":"110102001","name":"西长安街街道"},{"code":"110102003","name":"新街口街道"},{"code":"110102007","name":"月坛街道"},{"code":"110102009","name":"展览路街道"},{"code":"110102010","name":"德胜街道"},{"code":"110102011","name":"金融街街道"},{"code":"110102012","name":"什刹海街道"},{"code":"110102013","name":"大栅栏街道"},{"code":"110102014","name":"天桥街道"},{"code":"110102015","name":"椿树街道"},{"code":"110102016","name":"陶然亭街道"},{"code":"110102017","name":"广安门内街道"},{"code":"110102018","name":"牛街街道"},{"code":"110102019","name":"白纸坊街道"},{"code":"110102020","name":"广安门外街道"}]},{"code":"110105","name":"朝阳区","children":[{"code":"110105001","name":"建外街道"},{"code":"110105002","name":"朝外街道"},{"code":"110105003","name":"呼家楼街道"},{"code":"110105004","name":"三里屯街道"},{"code":"110105005","name":"左家庄街道"},{"code":"110105006","name":"香河园街道"},{"code":"110105007","name":"和平街街道"},{"code":"110105008","name":"安贞街道"},{"code":"110105009","name":"亚运村街道"},{"code":"110105010","name":"小关街道"},{"code":"110105011","name":"酒仙桥街道"},{"code":"110105012","name":"麦子店街道"},{"code":"110105013","name":"团结湖街道"},{"code":"110105014","name":"六里屯街道"},{"code":"110105015","name":"八里庄街道"},{"code":"110105016","name":"双井街道"},{"code":"110105017","name":"劲松街道"},{"code":"110105018","name":"潘家园街道"},{"code":"110105019","name":"垡头街道"},{"code":"110105021","name":"南磨房地区"},{"code":"110105022","name":"高碑店地区"},{"code":"110105023","name":"将台地区"},{"code":"110105024","name":"太阳宫地区"},{"code":"110105025","name":"大屯街道"},{"code":"110105026","name":"望京街道"},{"code":"110105027","name":"小红门地区"},{"code":"110105028","name":"十八里店地区"},{"code":"110105029","name":"平房地区"},{"code":"110105030","name":"东风地区"},{"code":"110105031","name":"奥运村街道"},{"code":"110105032","name":"来广营地区"},{"code":"110105033","name":"常营地区"},{"code":"110105034","name":"三间房地区"},{"code":"110105035","name":"管庄地区"},{"code":"110105036","name":"金盏地区"},{"code":"110105037","name":"孙河地区"},{"code":"110105038","name":"崔各庄地区"},{"code":"110105039","name":"东坝地区"},{"code":"110105040","name":"黑庄户地区"},{"code":"110105041","name":"豆各庄地区"},{"code":"110105042","name":"王四营地区"},{"code":"110105043","name":"东湖街道"},{"code":"110105400","name":"首都机场街道"}]},{"code":"110106","name":"丰台区","children":[{"code":"110106001","name":"右安门街道"},{"code":"110106002","name":"太平桥街道"},{"code":"110106003","name":"西罗园街道"},{"code":"110106004","name":"大红门街道"},{"code":"110106005","name":"南苑街道"},{"code":"110106006","name":"东高地街道"},{"code":"110106007","name":"东铁匠营街道"},{"code":"110106008","name":"卢沟桥街道"},{"code":"110106009","name":"丰台街道"},{"code":"110106010","name":"新村街道"},{"code":"110106011","name":"长辛店街道"},{"code":"110106012","name":"云岗街道"},{"code":"110106013","name":"方庄地区"},{"code":"110106014","name":"宛平城地区"},{"code":"110106015","name":"马家堡街道"},{"code":"110106016","name":"和义街道"},{"code":"110106017","name":"卢沟桥地区"},{"code":"110106018","name":"花乡地区"},{"code":"110106019","name":"南苑地区"},{"code":"110106100","name":"长辛店镇"},{"code":"110106101","name":"王佐镇"}]},{"code":"110107","name":"石景山区","children":[{"code":"110107001","name":"八宝山街道"},{"code":"110107002","name":"老山街道"},{"code":"110107003","name":"八角街道"},{"code":"110107004","name":"古城街道"},{"code":"110107005","name":"苹果园街道"},{"code":"110107006","name":"金顶街街道"},{"code":"110107009","name":"广宁街道"},{"code":"110107010","name":"五里坨街道"},{"code":"110107011","name":"鲁谷街道"}]},{"code":"110108","name":"海淀区","children":[{"code":"110108001","name":"万寿路街道"},{"code":"110108002","name":"永定路街道"},{"code":"110108003","name":"羊坊店街道"},{"code":"110108004","name":"甘家口街道"},{"code":"110108005","name":"八里庄街道"},{"code":"110108006","name":"紫竹院街道"},{"code":"110108007","name":"北下关街道"},{"code":"110108008","name":"北太平庄街道"},{"code":"110108010","name":"学院路街道"},{"code":"110108011","name":"中关村街道"},{"code":"110108012","name":"海淀街道"},{"code":"110108013","name":"青龙桥街道"},{"code":"110108014","name":"清华园街道"},{"code":"110108015","name":"燕园街道"},{"code":"110108016","name":"香山街道"},{"code":"110108017","name":"清河街道"},{"code":"110108018","name":"花园路街道"},{"code":"110108019","name":"西三旗街道"},{"code":"110108020","name":"马连洼街道"},{"code":"110108021","name":"田村路街道"},{"code":"110108022","name":"上地街道"},{"code":"110108023","name":"万柳地区"},{"code":"110108024","name":"东升地区"},{"code":"110108025","name":"曙光街道"},{"code":"110108026","name":"温泉地区"},{"code":"110108027","name":"四季青地区"},{"code":"110108028","name":"西北旺地区"},{"code":"110108029","name":"苏家坨地区"},{"code":"110108030","name":"上庄地区"}]},{"code":"110109","name":"门头沟区","children":[{"code":"110109001","name":"大峪街道"},{"code":"110109002","name":"城子街道"},{"code":"110109003","name":"东辛房街道"},{"code":"110109004","name":"大台街道"},{"code":"110109005","name":"王平地区"},{"code":"110109006","name":"永定地区"},{"code":"110109007","name":"龙泉地区"},{"code":"110109101","name":"潭柘寺镇"},{"code":"110109104","name":"军庄镇"},{"code":"110109105","name":"雁翅镇"},{"code":"110109106","name":"斋堂镇"},{"code":"110109107","name":"清水镇"},{"code":"110109108","name":"妙峰山镇"}]},{"code":"110111","name":"房山区","children":[{"code":"110111001","name":"城关街道"},{"code":"110111002","name":"新镇街道"},{"code":"110111004","name":"向阳街道"},{"code":"110111005","name":"东风街道"},{"code":"110111006","name":"迎风街道"},{"code":"110111007","name":"星城街道"},{"code":"110111008","name":"良乡地区"},{"code":"110111009","name":"周口店地区"},{"code":"110111010","name":"琉璃河地区"},{"code":"110111011","name":"拱辰街道"},{"code":"110111012","name":"西潞街道"},{"code":"110111101","name":"阎村镇"},{"code":"110111103","name":"窦店镇"},{"code":"110111104","name":"石楼镇"},{"code":"110111105","name":"长阳镇"},{"code":"110111107","name":"河北镇"},{"code":"110111108","name":"长沟镇"},{"code":"110111109","name":"大石窝镇"},{"code":"110111110","name":"张坊镇"},{"code":"110111111","name":"十渡镇"},{"code":"110111112","name":"青龙湖镇"},{"code":"110111115","name":"韩村河镇"},{"code":"110111208","name":"霞云岭乡"},{"code":"110111209","name":"南窖乡"},{"code":"110111210","name":"佛子庄乡"},{"code":"110111211","name":"大安山乡"},{"code":"110111212","name":"史家营乡"},{"code":"110111213","name":"蒲洼乡"}]},{"code":"110112","name":"通州区","children":[{"code":"110112001","name":"中仓街道"},{"code":"110112002","name":"新华街道"},{"code":"110112003","name":"北苑街道"},{"code":"110112004","name":"玉桥街道"},{"code":"110112005","name":"永顺地区"},{"code":"110112006","name":"梨园地区"},{"code":"110112007","name":"潞源街道"},{"code":"110112008","name":"通运街道"},{"code":"110112104","name":"宋庄镇"},{"code":"110112105","name":"张家湾镇"},{"code":"110112106","name":"漷县镇"},{"code":"110112109","name":"马驹桥镇"},{"code":"110112110","name":"西集镇"},{"code":"110112114","name":"台湖镇"},{"code":"110112117","name":"永乐店镇"},{"code":"110112119","name":"潞城镇"},{"code":"110112209","name":"于家务回族乡"}]},{"code":"110113","name":"顺义区","children":[{"code":"110113001","name":"胜利街道"},{"code":"110113002","name":"光明街道"},{"code":"110113003","name":"仁和地区"},{"code":"110113004","name":"后沙峪地区"},{"code":"110113005","name":"天竺地区"},{"code":"110113006","name":"杨镇地区"},{"code":"110113007","name":"牛栏山地区"},{"code":"110113008","name":"南法信地区"},{"code":"110113009","name":"马坡地区"},{"code":"110113010","name":"石园街道"},{"code":"110113011","name":"空港街道"},{"code":"110113012","name":"双丰街道"},{"code":"110113013","name":"旺泉街道"},{"code":"110113101","name":"高丽营镇"},{"code":"110113104","name":"李桥镇"},{"code":"110113105","name":"李遂镇"},{"code":"110113106","name":"南彩镇"},{"code":"110113108","name":"北务镇"},{"code":"110113109","name":"大孙各庄镇"},{"code":"110113110","name":"张镇"},{"code":"110113111","name":"龙湾屯镇"},{"code":"110113112","name":"木林镇"},{"code":"110113113","name":"北小营镇"},{"code":"110113115","name":"北石槽镇"},{"code":"110113116","name":"赵全营镇"}]},{"code":"110114","name":"昌平区","children":[{"code":"110114001","name":"城北街道"},{"code":"110114002","name":"南口地区"},{"code":"110114003","name":"马池口地区"},{"code":"110114004","name":"沙河地区"},{"code":"110114005","name":"城南街道"},{"code":"110114007","name":"东小口地区"},{"code":"110114008","name":"天通苑北街道"},{"code":"110114009","name":"天通苑南街道"},{"code":"110114010","name":"霍营街道"},{"code":"110114011","name":"回龙观街道"},{"code":"110114012","name":"龙泽园街道"},{"code":"110114013","name":"史各庄街道"},{"code":"110114104","name":"阳坊镇"},{"code":"110114110","name":"小汤山镇"},{"code":"110114111","name":"南邵镇"},{"code":"110114112","name":"崔村镇"},{"code":"110114113","name":"百善镇"},{"code":"110114115","name":"北七家镇"},{"code":"110114116","name":"兴寿镇"},{"code":"110114118","name":"流村镇"},{"code":"110114119","name":"十三陵镇"},{"code":"110114120","name":"延寿镇"}]},{"code":"110115","name":"大兴区","children":[{"code":"110115001","name":"兴丰街道"},{"code":"110115002","name":"林校路街道"},{"code":"110115003","name":"清源街道"},{"code":"110115004","name":"亦庄地区"},{"code":"110115005","name":"黄村地区"},{"code":"110115006","name":"旧宫地区"},{"code":"110115007","name":"西红门地区"},{"code":"110115008","name":"瀛海地区"},{"code":"110115009","name":"观音寺街道"},{"code":"110115010","name":"天宫院街道"},{"code":"110115011","name":"高米店街道"},{"code":"110115012","name":"荣华街道"},{"code":"110115013","name":"博兴街道"},{"code":"110115103","name":"青云店镇"},{"code":"110115104","name":"采育镇"},{"code":"110115105","name":"安定镇"},{"code":"110115106","name":"礼贤镇"},{"code":"110115107","name":"榆垡镇"},{"code":"110115108","name":"庞各庄镇"},{"code":"110115109","name":"北臧村镇"},{"code":"110115110","name":"魏善庄镇"},{"code":"110115111","name":"长子营镇"},{"code":"110115403","name":"北京经济技术开发区"},{"code":"110115404","name":"中关村国家自主创新示范区大兴生物医药产业基地"},{"code":"110115405","name":"国家新媒体产业基地"},{"code":"110115406","name":"大兴国际机场"}]},{"code":"110116","name":"怀柔区","children":[{"code":"110116001","name":"泉河街道"},{"code":"110116002","name":"龙山街道"},{"code":"110116003","name":"怀柔地区"},{"code":"110116004","name":"雁栖地区"},{"code":"110116005","name":"庙城地区"},{"code":"110116102","name":"北房镇"},{"code":"110116103","name":"杨宋镇"},{"code":"110116105","name":"桥梓镇"},{"code":"110116106","name":"怀北镇"},{"code":"110116107","name":"汤河口镇"},{"code":"110116108","name":"渤海镇"},{"code":"110116109","name":"九渡河镇"},{"code":"110116110","name":"琉璃庙镇"},{"code":"110116111","name":"宝山镇"},{"code":"110116211","name":"长哨营满族乡"},{"code":"110116213","name":"喇叭沟门满族乡"},{"code":"110116400","name":"北京雁栖经济开发区"}]},{"code":"110117","name":"平谷区","children":[{"code":"110117001","name":"滨河街道"},{"code":"110117002","name":"兴谷街道"},{"code":"110117003","name":"渔阳地区"},{"code":"110117004","name":"峪口地区"},{"code":"110117005","name":"马坊地区"},{"code":"110117006","name":"金海湖地区"},{"code":"110117101","name":"东高村镇"},{"code":"110117102","name":"山东庄镇"},{"code":"110117104","name":"南独乐河镇"},{"code":"110117105","name":"大华山镇"},{"code":"110117106","name":"夏各庄镇"},{"code":"110117108","name":"马昌营镇"},{"code":"110117110","name":"王辛庄镇"},{"code":"110117111","name":"大兴庄镇"},{"code":"110117112","name":"刘家店镇"},{"code":"110117114","name":"镇罗营镇"},{"code":"110117213","name":"黄松峪乡"},{"code":"110117214","name":"熊儿寨乡"}]},{"code":"110118","name":"密云区","children":[{"code":"110118001","name":"鼓楼街道"},{"code":"110118002","name":"果园街道"},{"code":"110118003","name":"檀营地区"},{"code":"110118100","name":"密云镇"},{"code":"110118101","name":"溪翁庄镇"},{"code":"110118102","name":"西田各庄镇"},{"code":"110118103","name":"十里堡镇"},{"code":"110118104","name":"河南寨镇"},{"code":"110118105","name":"巨各庄镇"},{"code":"110118106","name":"穆家峪镇"},{"code":"110118107","name":"太师屯镇"},{"code":"110118108","name":"高岭镇"},{"code":"110118109","name":"不老屯镇"},{"code":"110118110","name":"冯家峪镇"},{"code":"110118111","name":"古北口镇"},{"code":"110118112","name":"大城子镇"},{"code":"110118113","name":"东邵渠镇"},{"code":"110118114","name":"北庄镇"},{"code":"110118115","name":"新城子镇"},{"code":"110118116","name":"石城镇"},{"code":"110118400","name":"北京密云经济开发区"}]},{"code":"110119","name":"延庆区","children":[{"code":"110119001","name":"百泉街道"},{"code":"110119002","name":"香水园街道"},{"code":"110119003","name":"儒林街道"},{"code":"110119100","name":"延庆镇"},{"code":"110119101","name":"康庄镇"},{"code":"110119102","name":"八达岭镇"},{"code":"110119103","name":"永宁镇"},{"code":"110119104","name":"旧县镇"},{"code":"110119105","name":"张山营镇"},{"code":"110119106","name":"四海镇"},{"code":"110119107","name":"千家店镇"},{"code":"110119108","name":"沈家营镇"},{"code":"110119109","name":"大榆树镇"},{"code":"110119110","name":"井庄镇"},{"code":"110119200","name":"大庄科乡"},{"code":"110119201","name":"刘斌堡乡"},{"code":"110119202","name":"香营乡"},{"code":"110119203","name":"珍珠泉乡"}]}]
             */

            private String code;
            private String name;
            private List<AreaBean> children;

            public String getCode() {
                return code;
            }

            public void setCode(String code) {
                this.code = code;
            }

            public String getName() {
                return name;
            }

            public void setName(String name) {
                this.name = name;
            }

            public List<AreaBean> getChildren() {
                return children;
            }

            public void setChildren(List<AreaBean> children) {
                this.children = children;
            }

            public static class AreaBean {
                /**
                 * code : 110101
                 * name : 东城区
                 * children : [{"code":"110101001","name":"东华门街道"},{"code":"110101002","name":"景山街道"},{"code":"110101003","name":"交道口街道"},{"code":"110101004","name":"安定门街道"},{"code":"110101005","name":"北新桥街道"},{"code":"110101006","name":"东四街道"},{"code":"110101007","name":"朝阳门街道"},{"code":"110101008","name":"建国门街道"},{"code":"110101009","name":"东直门街道"},{"code":"110101010","name":"和平里街道"},{"code":"110101011","name":"前门街道"},{"code":"110101012","name":"崇文门外街道"},{"code":"110101013","name":"东花市街道"},{"code":"110101014","name":"龙潭街道"},{"code":"110101015","name":"体育馆路街道"},{"code":"110101016","name":"天坛街道"},{"code":"110101017","name":"永定门外街道"}]
                 */

                private String code;
                private String name;
                private List<StreetBean> children;

                public String getCode() {
                    return code;
                }

                public void setCode(String code) {
                    this.code = code;
                }

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }

                public List<StreetBean> getChildren() {
                    return children;
                }

                public void setChildren(List<StreetBean> children) {
                    this.children = children;
                }

                public static class StreetBean {
                    /**
                     * code : 110101001
                     * name : 东华门街道
                     */

                    private String code;
                    private String name;

                    public String getCode() {
                        return code;
                    }

                    public void setCode(String code) {
                        this.code = code;
                    }

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }
                }
            }
        }
    }
}
